#!/usr/bin/env python3
# coding  : utf-8
# @author : Francis.zz
# @date   : 2021-07-14 18:05
# @desc   : 

import xlsxwriter
import re


error_code_str = """
    /*==================================公共错误 000XXX start==================================================*/
    // 成功，禁止修改
("0", "success")
    // 系统内部错误
("00001", "系统错误")
    // 数据库错误 查询数据库出错。没有更新到预期的记录。
("00002", "数据库错误")
    // 远程服务错误 和远程服务器交互出错 比如：连接超时，远程服务器返回数据有问题（包括通卡公司返回的签名有问题）等
("00003", "请求第三方接口错误，如连接超时、read timeout")
    // 远程服务器没有返回
("00004", "第三方接口响应空数据")
    // 远程服务器返回错误码
("00005", "第三方接口返回了错误码")
    // 不支持的操作，不支持的功能
("00006", "操作不支持")
    // 参数为空
("00007", "参数错误，值为空")
    // 参数错误 接口调用者传入约定以外的值。
("00008", "参数错误，约定值以外的值")
    // 系统缺少相关参数配置
("00009", "系统缺少相关配置", "missing config, %s")
    // 系统资源不足
("00010", "卡片库存不足", "system resources not enough, %s")
    // 加密机连接或加密失败
("00011", "加密机连接失败")
    // 签名错误 华为、OPPO等手机厂商的签名
("00012", "验签失败")
    // 密钥解析错误
("00013", "卡片密钥解析错误", "parse key error, %s")
    // 不支持的操作
("00014", "不支持的操作", "not support [%s] opt")


    /** sd相关错误预留100-199 **/
    // 获取的token为空
("00100", "get token为空")
    // 获取Token失败
("00101", "get token请求错误")
    //  keyData为空
("00102", "keyData为空")
    // 外部认证失败
("00103", "卡片外部认证失败")
    // 安全通道没有成功建立
("00104","安全通道建立失败")
    // MAC1校验错误
("00105","mac1校验失败")
    //APDU内容为空
("00106","apdu响应为空")
("00107", "无效的KeyData")
("00108", "找不到密钥")
("00109", "创建安全通道失败")
("00110", "找不到安全通道中的安全域对象")
("00111", "找不到session中的安全通道")
("00112", "无效的initUpdate Response")
("00113", "验证initUpdate Response失败")
("00114", "准备外部认证APDU失败")
("00115", "外部认证APDU验不过，密钥错误")
    /*==================================公共错误 end===========================================================*/

    /*==================================查询订单 20XXX start==================================================*/
("20001", "订单不是自动充值类型")
("20002", "无效订单")
("20002", "非法订单，状态异常")
    /*==================================查询订单 end===========================================================*/

    /*==================================创建订单 21XXX start==================================================*/
    // 机型不支持
("21001", "机型不支持")
    // 业务已关闭
("21002", "业务已关闭")
    // 优惠额度不足
("21003", "优惠额度不足")
    // 优惠名额已经用完
("21004", "优惠名额已经用完")
    // 当前手机型号在当前时间存在多个活动
("21005", "当前手机型号在当前时间存在多个活动")
    // 已经退款成功，防重复
("21007", "已退款，重复操作")
    // 已经退款失败，防重复
("21008", "已发起退款但退款失败，重复操作")
    // 已经退款申请，防重复
("21009", "已申请退款，重复操作")
    // 不能多次退款，防重复
("21010", "重复发起退款请求")
    // 卡片不存在或已被删除
("21011", "卡号不存在或卡片已删除")
    // 活动不存在
("21012", "活动名额已用完")
    // 金额校验失败
("21013", "金额校验失败")
    // 活动码不存在
("21014", "活动代码不存在")

    /*==================================创建订单 end===========================================================*/

    /*==================================获取开卡充值金额 22XXX start==========================================*/
    /*==================================获取开卡充值金额 end===================================================*/

    /*==================================下载安装 230XXX start==================================================*/
    // 芯片类型为空 安装参数和芯片类型有关
("23006", "芯片类型参数为空")
    // 卡片库存不足
("23007", "卡片库存不足")
    // 下载APDU执行失败
("23008", "apdu执行失败")
    /*==================================下载安装 end===========================================================*/

    /*==================================个人化 开卡 24XXX start=================================================*/
    // 不能开卡（实例未创建）
("24001", "未创建实例，无法个人化")
    // 订单未支付 开卡和充值的时候，需要订单已经支付
("24002", "订单未支付")
    // 订单不存在 根据订单号和渠道查询不到订单
("24003", "订单不存在")
    // 订单状态异常
("24004", "订单状态异常")
    // seApplication没有记录
("24005", "未找到seid对应的开卡记录")
    // 写卡MAC失败
("24008", "MAC写卡失败")
    // 上报订单失败
("24009", "订单上报失败")
    // 没有找到cardMaintain或者cityCode
("24011", "卡片信息有误，无法获取卡片归属城市代码信息")
    // 个人化APDU数据为空
("24013", "APDU响应为空")

    // 个人化APDU执行失败
("24016", "APDU执行失败")

    /*==================================个人化 开卡 end======================================================== */

    /*==================================充值 25XXX start======================================================*/
(不是开卡成功状态)
("25001", "开卡未成功，不允许充值")
    // 订单已充值成功，不能重复执行
("25002", "订单重复充值请求")
    // 余额超过上限
("25005", "卡片余额超限")
    // 充值失败，联系客服。 充值状态有问题
("25006", "充值失败")
    // 卡号不匹配。从0015文件中读取的卡号和接口请求的卡号不一致
("25007", "充值请求的卡号与卡片实际卡号不匹配")

    // 不支持的外部城市代码card_external_code
("25010", "不支持的城市")
    // 不支持的mobile mode
("25011", "不支持的机型")
    // 充值APDU执行失败
("25012", "APDU执行失败")
("25013", "订单不存在")
    // 签约ID不存在
("25014", "签约ID不存在")
    // 签约ID已存在，不能重复调用签约接口，请先查询签约状态
("25015", "签约ID已存在，不能重复调用签约接口")
    // 签约进行中，请稍后重试。创建代扣订单需要等签约完成
("25016", "签约进行中，创建代扣订单需要等签约完成")
    // 未签约，不能进行代扣充值操作
("25017", "未签约，不能进行代扣充值操作")
("25018", "银联签约字段customerInfo为空")
("25019", "卡号未签约")
("25020", "卡号代扣类型不匹配")
("25021", "签约协议号未签约")
("25022", "卡号重复签约")
("25023", "用户已签约")
("25024", "不允许签约或解约")
    /*==================================充值 end===============================================================*/

/*==================================删卡26XXX (包括format.ese) start======================================*/
    // 退款金额大于订单总金额
("26001", "退款金额大于订单总金额")
    // 删卡APDU执行失败
("26003", "APDU执行失败")
    // 卡余额被修改
("26005", "读卡余额与请求余额不匹配，禁止删卡")
    // 没有余额 卡片恢复的时候，需要写入余额，余额是必须的
("26006", "未找到卡片余额信息")
("26007", "卡片未找到备份数据，禁止移除")
("26008", "卡片已透支，无法删除")
("26010", "不允许的删卡原因")

/*==================================删卡(包括format.ese) end===============================================*/

    /*==================================移除和恢复 27XXX start================================================*/
    // 没有备份数据
("27001", "卡片未找到备份数据或还未删卡")
    // 未备份%s应用的0015文件数据
("27002", "恢复数据组装异常")
    // 卡数据缺少%s标签
("27005","卡片数据缺少15文件")
    // 圈存密钥解析错误
("27006", "圈存密钥解析错误")
    // 该设备已经开过同类型卡或已恢复卡数据，无法再次进行恢复操作
("27007", "该设备已经开过同类型卡或已恢复卡数据，无法再次进行恢复操作")
    // 恢复订单号与下载安装请求时的订单号不匹配
("27008", "恢复订单号与下载安装请求时的订单号不匹配")
    // 生成移除订单时，移除策略现在不满足。规定时间期限内， 同一卡号申请移除次数超过规定
("27010", "迁卡次数超限")
    // 申请恢复订单时， 同一卡号存在未完成的恢复订单
("27011", "存在未完成的恢复订单，不允许重复创建恢复订单")
    // 迁卡备份APDU执行失败
("27012", "备份APDU执行失败")
    // 迁卡恢复APDU执行失败
("27013", "恢复APDU执行失败")
    // 应用不存在
("27014", "应用实例不存在")
    // 迁卡条件检查APDU执行失败
("27015", "迁卡条件检查APDU执行失败")
    // 河北迁卡检查余额，超过5元返回此错误码
("27016", "余额超过规定限制，不允许迁卡")
("27017", "恢复订单已取消，无法发起恢复请求")
    /*==================================移除和恢复 end=========================================================*/

    /*==================================退款 28XXX start======================================================*/
    // 不允许退款
("28001", "不允许退款")
    // 退款金额不匹配
("28002", "退款金额不匹配")
    // 退款信息为空
("28003", "退款信息为空")
    /*==================================退款 end===============================================================*/
    
    /*==================================活动优惠模块 30XXX start======================================================*/
    // 卡片已删除
("30011", "卡片已删除")
    // 未找到卡片信息
("30012", "未找到卡片信息")
    // 优惠券信息过期
("30013", "优惠券过期")
    /*==================================退款 end===============================================================*/
"""


if __name__ == '__main__':
    for line in error_code_str.splitlines():
        if line is None:
            continue
        elif line == '':
            continue

        pure_line = line.strip()
        if pure_line.find('/*') != -1 and pure_line.find('end') != -1:
            continue
        if pure_line.find('/*') != -1 and pure_line.find('start') != -1:
            print(re.search('/\*=*(.*)=*\*/', pure_line).group(1).split(" ")[0])
        if pure_line.startswith("//"):
            continue
        if pure_line.startswith("("):
            msg_arr = re.search('\((.*)\)', pure_line)[1].replace("\"", "").split(",")
            if len(msg_arr) != 2:
                continue
            print(f'{msg_arr[0].strip()}    {msg_arr[1].strip()}')
    #workbook = xlsxwriter.Workbook("F:\\错误码.xlsx")
    #workbook.add_worksheet("错误码说明")
    pass
